## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
uploadS3Assets.tf
```
```terraform
Plan: 74 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_s3_object.assets[&quot;static/assign-en.svg&quot;]`                        |
|        | `aws_s3_object.assets[&quot;static/assign-fr.svg&quot;]`                        |
|        | `aws_s3_object.assets[&quot;static/built4you-v2.svg&quot;]`                     |
|        | `aws_s3_object.assets[&quot;static/built4you.svg&quot;]`                        |
|        | `aws_s3_object.assets[&quot;static/cloud-flow.svg&quot;]`                       |
|        | `aws_s3_object.assets[&quot;static/custom-branding-en.svg&quot;]`               |
|        | `aws_s3_object.assets[&quot;static/custom-branding-fr.svg&quot;]`               |
|        | `aws_s3_object.assets[&quot;static/dashboard-en.svg&quot;]`                     |
|        | `aws_s3_object.assets[&quot;static/dashboard-fr.svg&quot;]`                     |
|        | `aws_s3_object.assets[&quot;static/examples/example-filter-en.svg&quot;]`       |
|        | `aws_s3_object.assets[&quot;static/examples/example-filter-fr.svg&quot;]`       |
|        | `aws_s3_object.assets[&quot;static/examples/example-headers-en.svg&quot;]`      |
|        | `aws_s3_object.assets[&quot;static/examples/example-headers-fr.svg&quot;]`      |
|        | `aws_s3_object.assets[&quot;static/examples/example-row-en.svg&quot;]`          |
|        | `aws_s3_object.assets[&quot;static/examples/example-row-fr.svg&quot;]`          |
|        | `aws_s3_object.assets[&quot;static/examples/example-variable-en.svg&quot;]`     |
|        | `aws_s3_object.assets[&quot;static/examples/example-variable-fr.svg&quot;]`     |
|        | `aws_s3_object.assets[&quot;static/features/features-api-en.svg&quot;]`         |
|        | `aws_s3_object.assets[&quot;static/features/features-api-fr.svg&quot;]`         |
|        | `aws_s3_object.assets[&quot;static/features/features-branding-en.svg&quot;]`    |
|        | `aws_s3_object.assets[&quot;static/features/features-branding-fr.svg&quot;]`    |
|        | `aws_s3_object.assets[&quot;static/features/features-dashboard-en.svg&quot;]`   |
|        | `aws_s3_object.assets[&quot;static/features/features-dashboard-fr.svg&quot;]`   |
|        | `aws_s3_object.assets[&quot;static/features/features-personalize-en.svg&quot;]` |
|        | `aws_s3_object.assets[&quot;static/features/features-personalize-fr.svg&quot;]` |
|        | `aws_s3_object.assets[&quot;static/features/features-recipients-en.svg&quot;]`  |
|        | `aws_s3_object.assets[&quot;static/features/features-recipients-fr.svg&quot;]`  |
|        | `aws_s3_object.assets[&quot;static/features/features-scheduler-en.svg&quot;]`   |
|        | `aws_s3_object.assets[&quot;static/features/features-scheduler-fr.svg&quot;]`   |
|        | `aws_s3_object.assets[&quot;static/features/features-team-en.svg&quot;]`        |
|        | `aws_s3_object.assets[&quot;static/features/features-team-fr.svg&quot;]`        |
|        | `aws_s3_object.assets[&quot;static/features/features-templates-en.svg&quot;]`   |
|        | `aws_s3_object.assets[&quot;static/features/features-templates-fr.svg&quot;]`   |
|        | `aws_s3_object.assets[&quot;static/goc--footer-logo.svg&quot;]`                 |
|        | `aws_s3_object.assets[&quot;static/gov-canada-en.svg&quot;]`                    |
|        | `aws_s3_object.assets[&quot;static/gov-canada-fr.svg&quot;]`                    |
|        | `aws_s3_object.assets[&quot;static/integrate-1.svg&quot;]`                      |
|        | `aws_s3_object.assets[&quot;static/integrate.svg&quot;]`                        |
|        | `aws_s3_object.assets[&quot;static/letter-en-v2.svg&quot;]`                     |
|        | `aws_s3_object.assets[&quot;static/letter-en.svg&quot;]`                        |
|        | `aws_s3_object.assets[&quot;static/letter-fr-v2.svg&quot;]`                     |
|        | `aws_s3_object.assets[&quot;static/letter-fr.svg&quot;]`                        |
|        | `aws_s3_object.assets[&quot;static/mac-phone.svg&quot;]`                        |
|        | `aws_s3_object.assets[&quot;static/message-status-image-en.svg&quot;]`          |
|        | `aws_s3_object.assets[&quot;static/message-status-image-fr.svg&quot;]`          |
|        | `aws_s3_object.assets[&quot;static/personalise-en.svg&quot;]`                   |
|        | `aws_s3_object.assets[&quot;static/personalise-fr.svg&quot;]`                   |
|        | `aws_s3_object.assets[&quot;static/pricing-en-v2.svg&quot;]`                    |
|        | `aws_s3_object.assets[&quot;static/pricing-en.svg&quot;]`                       |
|        | `aws_s3_object.assets[&quot;static/pricing-fr-v2.svg&quot;]`                    |
|        | `aws_s3_object.assets[&quot;static/pricing-fr.svg&quot;]`                       |
|        | `aws_s3_object.assets[&quot;static/recipients-en.svg&quot;]`                    |
|        | `aws_s3_object.assets[&quot;static/recipients-fr.svg&quot;]`                    |
|        | `aws_s3_object.assets[&quot;static/schedule-email-en.svg&quot;]`                |
|        | `aws_s3_object.assets[&quot;static/schedule-email-fr.svg&quot;]`                |
|        | `aws_s3_object.assets[&quot;static/send-en.svg&quot;]`                          |
|        | `aws_s3_object.assets[&quot;static/send-fr.svg&quot;]`                          |
|        | `aws_s3_object.assets[&quot;static/text-messages-en-v2.svg&quot;]`              |
|        | `aws_s3_object.assets[&quot;static/text-messages-en.svg&quot;]`                 |
|        | `aws_s3_object.assets[&quot;static/text-messages-fr-v2.svg&quot;]`              |
|        | `aws_s3_object.assets[&quot;static/text-messages-fr.svg&quot;]`                 |
|        | `aws_s3_object.assets[&quot;static/text-messages-no-variables-en.svg&quot;]`    |
|        | `aws_s3_object.assets[&quot;static/text-messages-no-variables-fr.svg&quot;]`    |
|        | `aws_s3_object.assets[&quot;static/why-notify/bolt.svg&quot;]`                  |
|        | `aws_s3_object.assets[&quot;static/why-notify/check.svg&quot;]`                 |
|        | `aws_s3_object.assets[&quot;static/why-notify/cloud.svg&quot;]`                 |
|        | `aws_s3_object.assets[&quot;static/why-notify/experiment.svg&quot;]`            |
|        | `aws_s3_object.assets[&quot;static/why-notify/lock.svg&quot;]`                  |
|        | `aws_s3_object.assets[&quot;static/why-notify/privacy.svg&quot;]`               |
|        | `aws_s3_object.assets[&quot;static/why-notify/secure.svg&quot;]`                |
|        | `aws_s3_object.assets[&quot;static/why-notify/sms.svg&quot;]`                   |
|        | `aws_s3_object.assets[&quot;static/why-notify/user-secret.svg&quot;]`           |
|        | `aws_s3_object.assets[&quot;static/why-notify/vial.svg&quot;]`                  |
|        | `aws_s3_object.assets[&quot;static/why-notify/wand-magic-sparkles.svg&quot;]`   |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/notification-terraform/actions/runs/6711381337).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_object.assets["static/assign-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/assign-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/assign-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/assign-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/assign-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/assign-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/built4you-v2.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/built4you-v2.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/built4you-v2.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/built4you.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/built4you.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/built4you.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/cloud-flow.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/cloud-flow.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/cloud-flow.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/custom-branding-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/custom-branding-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/custom-branding-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/custom-branding-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/custom-branding-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/custom-branding-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/dashboard-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/dashboard-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/dashboard-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/dashboard-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/dashboard-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/dashboard-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/examples/example-filter-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/examples/example-filter-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/examples/example-filter-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/examples/example-filter-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/examples/example-filter-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/examples/example-filter-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/examples/example-headers-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/examples/example-headers-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/examples/example-headers-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/examples/example-headers-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/examples/example-headers-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/examples/example-headers-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/examples/example-row-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/examples/example-row-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/examples/example-row-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/examples/example-row-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/examples/example-row-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/examples/example-row-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/examples/example-variable-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/examples/example-variable-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/examples/example-variable-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/examples/example-variable-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/examples/example-variable-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/examples/example-variable-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-api-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/features/features-api-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/features/features-api-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-api-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/features/features-api-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/features/features-api-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-branding-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/features/features-branding-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/features/features-branding-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-branding-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/features/features-branding-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/features/features-branding-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-dashboard-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/features/features-dashboard-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/features/features-dashboard-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-dashboard-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/features/features-dashboard-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/features/features-dashboard-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-personalize-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/features/features-personalize-en.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/features/features-personalize-en.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-personalize-fr.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/features/features-personalize-fr.svg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/var/tmp/notification-admin/app/assets/cloudfront/static/features/features-personalize-fr.svg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.assets["static/features/features-recipients-en.svg"] will be created
  + resource "aws_s3_object" "assets" {
      + acl                    = (known after apply)
      + bucket                 = "notification-canada-ca-staging-asset-upload"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.expired-inflight-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healtheck-page-slow-response-critical[0]"]
WARN -...
```

</details>
